module.exports.config = {
  name: "goiadmin",
  version: "1.0.0-beta-fixbyDungUwU",
  permssion: 0,
  prefix: false,
  premium: false,
  credits: "ZyrosGenZ-fixbyDungUwU",
  description: "Bot will rep ng tag admin or rep ng tagbot ",
  category: "Other",
  usages: "",
  cooldowns: 1
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "61550669852479",) {
    var aid = ["61550669852479",];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = ["-𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 কই তুমি তোমারে এক বলদে ডাকে__//-😁🤣","Mantion_দিস না _𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 𝗲𝗿  মন ভালো নেই আস্কে-!_//-💔🥀","-আমার 𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 𝗲𝗿 সাথে কেউ সেক্স করে না থুক্কু টেক্স করে নাহ_//-🫂💔", "আমার একটা প্রিয়র খুব দরকার কারন আমার চোখে পানি আসার আগে নাকে সর্দি চলে আসে_//-🤣🤣","এত মেনশন না দিয়ে 𝗧𝗮𝗻𝘃𝗶𝗿 𝗲𝗿 𝗶𝗻𝘃Ø𝘅 𝗮 আসো হট করে দিবো 𝗷𝗮𝗻_//-😘🥒"," Mantion_দিলে চুম্মাইয়া ঠুটের কালার change কইরা,লামু _//-💋😾😾🔨","এতু ইমুশানাল কথা বলো তল দেশ দিয়ে অজরে বৃষ্টি হচ্ছে আমার 𝗯Ø𝘀𝘀 𝘁𝗮𝗻𝘃𝗶𝗿 𝗲𝗿 _//-😭🤣🤣","-𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 এখন  বিজি জা বলার আমাকে বলতে পারেন_!!_//-😼🥰","এতো মেনশন  নাহ দিয়া সিংগেল 𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 রে একটা bØw দে_//-🥹😏","Mantion_না দিয়ে সিরিয়াস প্রেম করতে চাইলে ইনবক্স 𝗷𝗮 𝗧𝗮𝗻𝘃𝗶𝗿 𝗲𝗿_//-😁🫣","মেনশন দিসনা পারলে একটা bØw দে_//-🥱","Mantion_দিস না বাঁলপাঁক্না 𝘁𝗮𝗻𝘃𝗶𝗿 প্রচুর বিজি _//-🥵🥀🤐","চুমু খাওয়ার বয়স টা  চকলেট🍫খেয়ে উড়িয়ে দি𝗹Ø 𝗮𝗺𝗿 𝗕𝗢𝗦𝗦_//-🥹🤗","-𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥  কে এতো ডাকো কেন_//-🙄, ভালো টালো বাসো নাকি 𝗧𝗮𝗻𝘃𝗶𝗿 𝗿𝗲_//-🤭", " -𝗧𝗮𝗻𝘃𝗶𝗿 কে আর একবার মেনশন দিলে তোমার নাকের মধ্যে ঘুষি মারমু_//-😡", "-𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 এখন 𝗖𝗼𝗹𝗹𝗮𝗴𝗲 এ বিজি আছে যা বলার আমাকে বলো_//-🫣", "যা বলার আমাকে বলো -𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 এখন বিজি আছে_//-🥰","-𝗕Ø𝗦𝗦 𝗧𝗔𝗡𝗩𝗜𝗥 কে আর একবার মেনশন দিলে তোমারে থাবরাইয়া মুতের কালার চেঞ্জ কইরা ফালামু _//-🤭🙈🤖"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }
};
module.exports.run = async function({}) {
        }
